# 1. Расположение магазинов
# Реализовать метод класса для Shops (предудыщий урок), который будет выводить
# расположение всех магазинов на графике (используйте matplotlib).

# 2. Запрет неверных значений
# Реализуйте товары из задания для прошлого урока так, чтобы нельзя было
# устанавливать неверное значение для атрибутов цена и количество. Т. е.
# запретить такую возможность tea.price = 'Цена как строка'

# 3*. Singleton
# Реализовать шаблон проектирования Singleton с помощью:
#   - __new__ - магический метод, который создаёт экземпляры
#   - декората для класса
#   - метакласса
