# 1. Создать страницу для редактирования заметок.
# При нажатии на название Sheet, сайт должен перенаправить пользователя на
# страницу, где будет отображаться только один конкретный TODO список.
# На данной странице пользователь может удалить выполненные задачи и поменять
# заголовок для Sheet.

# 2. Отображение листов.
# Отображать другим цветом Sheet, если Sheet все заметки (notes) выполнены.

# 3. Удаление
# Каждая страница можно удалить. Создайте кнопку, которая будет располагаться
# у загаловка страницы и отвечать за удаление данной страницы.

# 4*. Добавление пользователей.
# Добавьте в систему пользователей. Каждый пользователь имеет свои страницы.
# Добавить логирование пользователь. Когда пользователь входит в систему, то он
# видит только свои страницы (см. integrate pony with flask).
